#include <stdio.h>
#include <math.h> 

/*
所谓“沙漏形状”，是指每行输出奇数个符号；各行符号中心对齐；相邻两行符号数差2；符号数先从大到小顺序递减到1，再从小到大顺序递增；首尾符号数相等。
给定任意N个符号，不一定能正好组成一个沙漏。要求打印出的沙漏能用掉尽可能多的符号。

输入格式:
输入在一行给出1个正整数N（≤1000）和一个符号，中间以空格分隔。
输入样例:
19 *

输出格式:
首先打印出由给定符号组成的最大的沙漏形状，最后在一行中输出剩下没用掉的符号数。
输出样例:
*****
 ***
  *
 ***
*****
2
*/ 

int main()
{
	int n,l,i,j;
	char ch;
	if(scanf("%d",&n) && n<=1000)
	{
		while(getchar()!=' ');  //不读取空格 
		ch=getchar();
		if(n < 7)  //只能输出一行
		{ 
			printf("%c\n",ch);
			if(n-1 >= 0)
				printf("%d\n",n-1);  //剩下没用掉的符号数,0也需输出
		}
		else  //输出多行的沙漏，计算行数为：(l-1)*2-1
		{
			for(l=1; l<=sqrt(n); l++)
			{
				if(2*l*l-1 > n)
					break;
			}
//			printf("l = %d\n",l);
			for(i=0; i<l-1; i++)  //上半部分 
			{
				for(j=0; j<i; j++)
					printf(" ");
				for(j=0; j<((l-1)*2-1)-2*i; j++)
					printf("%c",ch);
				printf("\n");
			}
			for(i=l-2; i>0; i--)  //下半部分 
			{
				for(j=0; j<i-1; j++)
					printf(" ");
				for(j=0; j<((l-1)*2-1)-2*(i-1); j++)
					printf("%c",ch);
				printf("\n");
			} 
			printf("%d\n",n-2*(l-1)*(l-1)+1);  //剩下没用掉的符号数，0也需输出
		}
	}
	return 0;
} 
